read_verilog -sv rtl/*.sv;
hierarchy -top common_top; flatten; proc; fsm; opt; memory; opt;
techmap; opt;
dfflibmap -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
clean -purge
write_verilog -noattr netlist.v
stat -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
